package home_work_1;

public class Priority7 {
    public static void main(String[] args) {
        int a = 5;
        int b = 7;
        int c = 8;
        int x = 2;
        int w = 68;
        int z;
        //Задача не решается так как булево значение 68>=68 невозможно сравнить с числовым типом данных.

//        if (w > 68) {
//            z = w+1;
//        }
//        else if (w < 68) {
//            z = w - 1;
//        }
//        else {
//            z = w;
//        }
//        int d = (a + b > 20 ? z : 22 * x >> x++) / --c;
//        //я оператором управления if хотела привести булево значение (68>=68) к числовому (68). Это единстевнное, что пришло в голову для решения вопроса
//        //5+7>20 - false. Значит 68 не подходит (изспользуется с true). Переходим ко второму блоку тернарного оператора.
//        //22*2=44. Переводим 44 в бинорное значение -> 00101100.
//        //применяем оператор сдвиг влево на 2. Получаем 00001011. Это число 11.
//        //++ в данном случае игнорируем так как это пост-инкремент, +1 добавилось бы при следующем использовании переменной x.
//        //--с = 7. 11/7=1,571. Int отбрасывает дробную часть 0,571. Результат 1.
//
//        System.out.println("d = " + d);
    }
}